{"name":"Familiars - Oddity of Form","die":"1d100","rows":[{"description":"Additional Eye: Your familiar has one more eye than would be normal for a creature of its type.","range":[1,3]},{"description":"Barbed Tongue: Your familiar’s tongue ends in strange barbs. Tongue Attack trait, rating SB, range TB yards.","range":[4,4]},{"description":"Bizarre Colour: Your familiar is a strange colour: purple, pink, blue. You may choose a mix of colours.","range":[5,7]},{"description":"Blind: Your familiar has no eyes, and cannot see.","range":[8,11]},{"description":"Claws: Your familiar has claws. Weapon trait, damage SB + 4.","range":[12,12]},{"description":"Corpulent: Your familiar appears astoundingly obese for a creature of its size. Brute trait.","range":[13,15]},{"description":"Deaf: Your familiar cannot hear.","range":[16,19]},{"description":"Extra Digits: Your familiar has 1d10 more fingers or toes than would be normal for a creature of its type. +5 Dex.","range":[20,22]},{"description":"Extra Limb: Your familiar has an extra arm or leg. +5 S.","range":[23,25]},{"description":"Fangs: Your familiar has fangs. Weapon trait, damage SB + 4.","range":[26,26]},{"description":"Fragrant. You familiar has a pleasant odour, smelling of flowers, spices, or herbs. +5 Fel.","range":[27,29]},{"description":"Fur: Your familiar is covered in a coat of soft or coarse fur. Armour 1 trait.","range":[30,32]},{"description":"Gaunt: Your familiar is markedly gaunt to the point of appearing emaciated. +1 to Frightening talent rating.","range":[33,35]},{"description":"Horns: Your familiar has a pair of sharp horns. Horns trait, rating SB + 1.","range":[36,36]},{"description":"Humanoid Face: Your familiar has an eerie face, much like that of a man, woman, or child. +1 to Frightening talent rating.","range":[37,39]},{"description":"Humanoid Hands: Your familiar has humanoid hands, complete with opposable thumbs. +10 Dex.","range":[40,42]},{"description":"Missing Digits: Your familiar is missing 1d10 fingers or toes. -5 Dex.","range":[43,45]},{"description":"Missing Limb: Your familiar is missing a limb that it would normally have. -5 S.","range":[46,48]},{"description":"Musky: Your familiar has a strong musky aroma. -1 SLs when trying to use Stealth.","range":[49,51]},{"description":"No Shadow: Your familiar does not cast a shadow.","range":[52,54]},{"description":"Scales: Scales cover your familiar’s hide. Armour 2 trait.","range":[55,57]},{"description":"Shell or Carapace: Your familiar has a hard shell or tough carapace. Armour 3 trait.","range":[58,58]},{"description":"Slimy: Your familiar’s body naturally exudes a damp slimy substance, and leaves a slime trail wherever it goes.","range":[59,61]},{"description":"Strange Eye Colour: Your familiar has startling eye colour, such as purple, yellow, or even orange.","range":[62,64]},{"description":"Tail: Substantial and prehensile. Tail Attack trait, rating SB + 1.","range":[65,67]},{"description":"Tentacles: Your familiar sprouts tentacles. It gains the Tentacles trait, 1d10 / 2, minimum of 1, tentacles, damage SB.","range":[68,70]},{"description":"Undead Appearance: Your familiar has a cadaverous appearance, looking as if it's rotting. +1 to Frightening talent rating.","range":[71,73]},{"description":"Unnerving Eyes: Your familiar has bizarre eyes, made from jewels, buttons, or mushrooms.","range":[74,76]},{"description":"Venom: Your familiar has a venomous bite, poisoned claws, or a stinger. Weapon SB+4 and Venom (Challenging) traits.","range":[77,79]},{"description":"Wings: Your familiar has wings. Fly trait, rating M x 10.","range":[80,82]},{"description":"Crawler: Your familiar has retractable claws or sticky pads on its appendages. Wallcrawler trait.","range":[83,85]},{"description":"Roll Twice: Roll twice more on this table.","range":[86,92]},{"description":"Player's Choice: You may choose any result on this table.","range":[93,97]},{"description":"GM's Choice: The GM may choose any result on this table.","range":[98,100]},{"description":"Weapon","range":[101,103]}]}